app/Controllers/Api/OrderController.php

SELECT *
FROM `orders`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
---
    public function getOrders()
    {
        $userId = $this->request->getGet('user_id');

        if (empty($userId)) {
            return $this->fail('Parameter user_id diperlukan.', 400);
        }

        $orderModel = new OrderModel();

        // Asumsi logic ini benar
        $orders = $orderModel
                        ->where('user_id', $userId)
                        ->orderBy('created_at', 'DESC')
                        ->findAll();