app/Controllers/Api/UserController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
UPDATE `users` SET `contact` = '0811231249'
WHERE `users`.`id` IN ('2')
---
    public function updateContact()
    {
        $rules = [
            'user_id' => 'required|integer',
            'contact' => 'required|max_length[15]'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $userId = $this->request->getPost('user_id');
        $newContact = $this->request->getPost('contact');

        $userModel = new UserModel();

        // Pastikan user ada
        if (!$userModel->find($userId)) {
            return $this->failNotFound('User tidak ditemukan.');
        }

        // Update kontak
        $updated = $userModel->update($userId, ['contact' => $newContact]);