app/Controllers/Admin.php

SELECT *
FROM `products`
SELECT *
FROM `orders`
---
    public function dashboard()
    {
        $productModel = new ProductModel();
        $orderModel = new OrderModel();

        $data = [
            'products' => $productModel->findAll(), // Semua produk
            'orders'   => $orderModel->findAll()  // Semua pesanan
        ];

SELECT *
FROM `products`
WHERE `products`.`id` = '3'
---
public function editProduct($id)
{
    $model = new ProductModel();
    $product = $model->find($id);