app/Controllers/Customer.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT *
FROM `orders`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
---
    public function profile()
    {
        $session = session();
        // Pastikan user_id tersedia dari sesi login
        $userId = $session->get('user_id');

        $userModel = new UserModel();
        $orderModel = new OrderModel();

        // 1. Ambil detail data user dari database
        $user = $userModel->find($userId);

        // 2. Ambil semua riwayat pesanan user ini (MERGE LOGIC)
        $orders = $orderModel->where('user_id', $userId)
                             ->orderBy('created_at', 'DESC') // Pesanan terbaru di atas
                             ->findAll();