app/Controllers/Shop.php

    public function index()
    {
        $productModel = new ProductModel();
        $data = [
            'products' => $productModel->findAll(),
            'title' => 'Toko Komputer - Katalog'
        ];
---
SELECT *
FROM `products`